import React from 'react'
import { Card, Paper, List, Box } from '@mui/material'


function Conditions() {
  return (
<div>
  <Box >
<Paper 
style={{maxHeight: 520, overflow: 'auto', padding : 5}}>
  <List>
제 1장 총칙<br/>
<br/>
제 1 조(목적)<br/>
<br/>
본 약관은 Hi Camping 웹사이트(이하 “Hi Camping")가 제공하는 모든 서비스(이하 "서비스")의 이용조건 및 절차, 회원과 Hi Camping 의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.<br/>
<br />
제 2 조(약관의 효력과 변경)<br/>
<br />
1. Hi Camping 은 이용자가 본 약관 내용에 동의하는 경우, Hi Camping 의 서비스 제공 행위 및 회원의 서비스 사용 행위에 본 약관이 우선적으로 적용됩니다.<br/>
2. Hi Camping 은 약관을 개정할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 Hi Camping 의 초기화면에 그 적용일 7일 이전부터 적용 전일까지 공지합니다. 단, 회원에 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 Hi Camping 은 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.<br/>
3. 변경된 약관은 국 Hi Camping 홈페이지에 공지하거나 e-mail을 통해 회원에게 공지하며, 약관의 부칙에 명시된 날부터 그 효력이 발생됩니다. 회원이 변경된 약관에 동의하지 않는 경우, 회원은 본인의 회원등록을 취소(회원탈퇴)할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이내에 거부의사를 표시하지 아니하고 서비스를 계속 사용할 경우는 약관 변경에 대한 동의로 간주됩니다.<br/>
<br />
제 3 조(약관 외 준칙)<br/>
<br />
본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법, 정보 통신 윤리 위원회 심의규정, <br/>
정보통신 윤리강령, 프로그램보호법 및 기타 관련 법령의 규정에 의합니다.<br/>
<br />
제 4 조(용어의 정의)<br/>
1. 서비스 : 이용자의 커뮤니케이션 및 사업자 회원의 제휴 홍보를 지원하는 서비스(이하 "서비스")를 의미합니다.<br/>
2. 이용자 : 본 약관에 따라 회사와 서비스 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는
공공기관 및 해당 기관의 개인 이용자를 의미합니다.<br/>
3.아이디(ID) : 이용자의 식별과 서비스 이용을 위하여 이용자가 정하고 회사가 승인하는 문자와 숫자의
조합을 의미합니다.<br/>
4.비밀번호 : 아이디(ID)와 일치된 이용자임을 확인하고, 이용자의 비밀을 보호하기 위해 이용자가 설정한
문자와 숫자의 조합을 의미합니다<br/>
  </List>
</Paper>
  </Box>
</div>
  )
}

export default Conditions
